Autodesk.Revit.DB.Plumbing.Pipe.CreatePlaceholder(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new placeholder pipe.
document:
The document.
systemTypeId:
The ElementId of the piping system type.
pipeTypeId:
The ElementId of the pipe type.
levelId:
The level id for the pipe.
startPoint:
The first point of the placeholder line.
endPoint:
The second point of the placeholder line.
Returns:
The placeholder pipe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid piping system type.
-or-
The pipe type pipeTypeId is not valid pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The points of startPoint and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Plumbing.Pipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Creates a new pipe that connects to two connectors.
Remarks:
The new pipe will have the same diameter and system type as the start connector. The creation will also connect the new pipe
to two component who owns the specified connectors. If necessary, additional fitting(s) are included to make a valid connection.
If the new pipe can not be connected to the next component (e.g., mismatched direction, no valid fitting, and etc), the new pipe
will still be created at the specified connector position, and an InvalidOperationException is thrown.
document:
The document.
pipeTypeId:
The ElementId of the new pipe type.
levelId:
The level ElementId for the new pipe.
startConnector:
The first connector where the new pipe starts.
endConnector:
The second point of the new pipe.
Returns:
The pipe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The pipe type pipeTypeId is not valid pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The connector domain is not Domain.Piping.
-or-
The points of startConnector and endConnector are too close: for MEPCurve, the minimum length is 1/10 inch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the new pipe fails to connect with the connector.
Since:
2015

Autodesk.Revit.DB.Plumbing.Pipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ)
Creates a new pipe that connects to the connector.
Remarks:
The new pipe will have the same diameter and system type as the specified connector. The creation will also connect the new pipe
to the component who owns the specified connector. If necessary, additional fitting(s) are included to make a valid connection.
If the new pipe can not be connected to the next component (e.g., mismatched direction, no valid fitting, and etc), the new pipe
will still be created at the specified connector position, and an InvalidOperationException is thrown.
document:
The document.
pipeTypeId:
The ElementId of the new pipe type.
levelId:
The level id for the new pipe.
startConnector:
The first connector where the new pipe starts.
endPoint:
The second point of the new pipe.
Returns:
The pipe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The pipe type pipeTypeId is not valid pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The connector domain is not Domain.Piping.
-or-
The points of startConnector and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the new pipe fails to connect with the connector.
Since:
2015

Autodesk.Revit.DB.Plumbing.Pipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new pipe from two points.
document:
The document.
systemTypeId:
The ElementId of the piping system type.
pipeTypeId:
The ElementId of the pipe type.
levelId:
The level ElementId for the pipe.
startPoint:
The start point of the pipe.
endPoint:
The end point of the pipe.
Returns:
The pipe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid piping system type.
-or-
The pipe type pipeTypeId is not valid pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The points of startPoint and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014